app/Validation/Userrules.php

SELECT *
FROM `tbl_users`
WHERE `email` = 'fernando.uchuya25@gmail.com'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data){
        $model = new UserModel();
        $user = $model->where('email', $data['email'])
                      ->first();