app/Controllers/User.php

    public function login()
    {
        $data = [];

        if ($this->request->getMethod() == 'post') {

            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => "Email or Password don't match",
                ],
            ];

            if (!$this->validate($rules, $errors)) {

                return view('auth/login', [
                    "validation" => $this->validator,
                ]);
            } else {
                $model = new UserModel();
                $user = $model->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `tbl_users`
WHERE `email` = 'fernando.uchuya25@gmail.com'
 LIMIT 1

    public function profile()
    {
        $data = [];
        $model = new UserModel();
        $data['user'] = $model->where('id', session()->get('id'))->first();
---
SELECT *
FROM `tbl_users`
WHERE `id` = '2'
 LIMIT 1